# ZVector Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CylindricalHelix..::..ZVector Property
CylindricalHelix Class See Also
---
The Z direction vector, which is same as the axis direction vector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ ZVector { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ZVector As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ ZVector {
	XYZ^ get ();
}
```

# See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace